[
  {
    "name": "The Zebra — Software Engineer II",
    "width": 85,
    "video": "https://d1o11p1jeyf1dw.cloudfront.net/TheZebra-SWE2.mp4",
    "website": "https://www.thezebra.com",
    "details": {
      "name": "The Zebra | 03.21 - 11.22",
      "description": "The Zebra is an insurance tech company creating and innovating a new market space for insurance. We compare and advise on which insurance would be best for a consumer. Since launching my corporate software engineering career at The Zebra, I have had the unique opportunity to work on 3 different teams. I have worked on high volume landing pages, complex multi-party API’s on the backend, and most recently a user information funnel.",
      "keyPoints": [
        "Provide mentorship to junior engineers through pair programming, code reviews, and 1:1 syncs",
        "Increased policy sales and improved user experience by pioneering the company’s first transactional email using a custom API to interface with Iterable (email sending service)",
        "Used Javascript, HTML, CSS, and Wagtail to create and edit landing page templates (including our homepage redesign) in accordance with designer’s provided specifications and Optimizely A/B test results to measurably increase user engagement",
        "Participated in company Frontend and Backend extracurriculars that focused on org-wide initiatives; most recently, helped to rework the company interview process to increase candidate quality and equalize opportunity"
      ],
      "icons": [
        "React",
        "Typescript",
        "Javascript",
        "HTML5",
        "CSS3",
        "Python",
        "FastAPI",
        "Wagtail",
        "Optimizely",
        "Atlassian",
        "Iterable"
      ]
    }
  },
  {
    "name": "Freelance — Software Engineer",
    "width": 35,
    "video": "https://d1o11p1jeyf1dw.cloudfront.net/Bidness.mp4",
    "website": "https://www.upwork.com",
    "details": {
      "name": "Freelance | 05.20 - 04.21",
      "description": "During this time I completed freelance work for a number of clients, usually updating and tweaking existing websites they owned but that were no longer being maintained by the original programmer. The majority of this work consisted of learning a codebase and then making changes involving but not limited to React, Javascript, HTML, and CSS. In addition to this, I was working with a small startup team to help build out their MVP using the same stack mentioned.",
      "keyPoints": [
        "Updated and maintained pre-existing websites using React, Javascript, HTML, and CSS",
        "Worked within a small team to build out an MVP following scrum and agile practices"
      ],
      "icons": [
        "React",
        "Javascript",
        "HTML5",
        "CSS3"
      ]
    }
  }
]